
Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(НомерКарты) Тогда
	      		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КартыЛояльности.НомерКарты КАК НомерКарты
		|ИЗ
		|	Справочник.КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	КартыЛояльности.Ссылка <> &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерКарты УБЫВ";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда 
			НомерКарты = Выборка.НомерКарты + 1; 
		Иначе 
			НомерКарты = 1;
		КонецЕсли;
		 		
	КонецЕсли;
	
КонецПроцедуры
