
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Баллы Приход
	Движения.Баллы.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Баллы.Добавить();
		
		Если СписатьБаллы Тогда
		     Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			 Движение.Количество = КоличествоСписанныхБалов;
		Иначе 	
		     Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
			 Движение.Количество = СуммаДокумента / 10;
		КонецЕсли;
		
		Движение.Период = Дата;
		Движение.КартаЛояльности = КартаЛаяльности;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	СуммаДокумента = Товары.Итог("Сумма") - КоличествоСписанныхБалов; 
	
	Если СуммаДокумента < 1 Тогда
	
		  Сообщение = Новый СообщениеПользователю;
		  Сообщение.Текст = "Сумма документа не может быть меньше 1р!";
		  Сообщение.Сообщить();
		  
		  Отказ = Истина;
	
	КонецЕсли;
	
КонецПроцедуры
