
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СуммаДокумента = Товары.Итог("Сумма") - КоличествоСписанныхБалов;
	
	// регистр Баллы Приход
	Движения.Баллы.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Баллы.Добавить();
		
		Если СписатьБаллы Тогда
		     Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			 Движение.Количество = КоличествоСписанныхБалов;
		Иначе 	
		     Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
			 Движение.Количество = СуммаДокумента / 10;
		КонецЕсли;
		
		Движение.Период = Дата;
		Движение.КартаЛояльности = КартаЛаяльности;
	КонецЦикла;

КонецПроцедуры
