#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.СписатьБаллы Тогда
		
		Элементы.КоличествоСписанныхБалов.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписатьБаллыПриИзменении(Элемент)

	Если Не Объект.СписатьБаллы Тогда
		
		Объект.КоличествоСписанныхБалов = 0; 
		Элементы.КоличествоСписанныхБалов.Доступность = Ложь;
		
	Иначе	
		Элементы.КоличествоСписанныхБалов.Доступность = Истина;
	КонецЕсли; 
	
	ПересчитатьСуммаДокумента();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КартаЛаяльностиПриИзмененииНаСервере(КартаЛаяльности)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БаллыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.Баллы.Остатки КАК БаллыОстатки
		|ГДЕ
		|	БаллыОстатки.КартаЛояльности = &КартаЛояльности";
	
	Запрос.УстановитьПараметр("КартаЛояльности", КартаЛаяльности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
		
	Выборка = РезультатЗапроса.Выбрать();  
	
	Если Выборка.Следующий()Тогда
		 Возврат Выборка.КоличествоОстаток;
	Иначе 	 
		 Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура КартаЛаяльностиПриИзменении(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("РеализацияТоваровИУслуг.Переключатель.КартаЛаяльности");
			
	КолВоБалов = КартаЛаяльностиПриИзмененииНаСервере(Объект.КартаЛаяльности); 
	
	Если КолВоБалов > 0 Тогда
		ВсегоБалов = КолВоБалов; 
	Иначе 	
		ВсегоБалов = 0;
	КонецЕсли;  
	
	ПересчитатьСуммаДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент) 
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;  
	
	ПересчитатьСуммаДокумента();
		
КонецПроцедуры

&НаКлиенте
Процедура КоличествоСписанныхБаловПриИзменении(Элемент)
	
  Если Объект.КоличествоСписанныхБалов > ВсегоБалов Тогда
  
  	   Объект.КоличествоСписанныхБалов = ВсегоБалов;
	   
	   Сообщение = Новый СообщениеПользователю;
	   Сообщение.Текст = "Можно списать максимум " + ВсегоБалов + " !";
	   Сообщение.Сообщить();
  
  КонецЕсли;
	
  Объект.Скидка = Объект.КоличествоСписанныхБалов; 
  
  ПересчитатьСуммаДокумента();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьСуммаДокумента();

	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") - Объект.КоличествоСписанныхБалов; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

 Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
 
 	  УИОДОП = ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Ложь, "РеализацияТоваровИУслуг");
 
  КонецЕсли;
 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(УИОДОП);
	КонецЕсли;

КонецПроцедуры


#КонецОбласти





